*** Statistics
    #+BEGIN_SRC python :results raw :session plop
import glob

import pandas as pd
from tabulate import tabulate


# Assuming everything is under the result dir...
ls = glob.iglob("alertstats.output/*.csv")
df = pd.read_csv(next(ls))
for f in ls:
    df = pd.concat([df, pd.read_csv(f)])

# Number of tracks
table = [
    ["Number of tracks", len(df)],
    ["Number of abnormal tracks", len(df[df.normality == 'abnormal'])],
    ["Faulty tracks", len(df[df.status == 1])]
]
tabulate(table, headers=["", "count"], tablefmt="orgtbl")
    #+END_SRC

    #+RESULTS:
    |                           |  count |
    |---------------------------+--------|
    | Number of tracks          | 237863 |
    | Number of abnormal tracks |   5764 |
    | Faulty tracks             | 147786 |


    #+BEGIN_SRC python :results raw :session plop
# let's account only for non faulty tracks
# those which aren't been filtered out by processAIS
df_ok = df[df.status == 0] # NoneType err
tabulate(df_ok.loc[:, ["duration", "length"]].describe(), headers="keys", tablefmt="orgtbl")
    #+END_SRC

    #+RESULTS:
    |       | duration |  length |
    |-------+----------+---------|
    | count |    90077 |   90077 |
    | mean  |  2.07906 | 751.725 |
    | std   |  0.22249 | 2930.02 |
    | min   |  1.49136 |      20 |
    | 25%   |  1.93709 |     166 |
    | 50%   |  2.04686 |     348 |
    | 75%   |   2.1962 |     677 |
    | max   |  3.74857 |  184408 |

    Reading: In average the alert function was able to handle approx one track
    every 2s . In other words, a single instance of the ~stream~ operator should
    be able to handle 0.5 track per second per CPU core.

